In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql postgresql://postgres:nubank@127.0.0.1/nubank

In [7]:
%sql SELECT * FROM accounts_table LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/nubank
5 rows affected.

[(509281836645315264, 3287830764476260864, datetime.datetime(2019, 11, 27, 22, 2, 48, 840000), 'active', '7763', '9', '38218'),
 (1464307209104691456, 2739905374464312320, datetime.datetime(2019, 4, 2, 12, 42, 1, 740000), 'active', '7183', '2', '1684'),
 (1433942275821296384, 1308631020777024000, datetime.datetime(2019, 1, 13, 1, 13, 23, 290000), 'active', '9161', '3', '47219'),
 (281026973294784032, 1534459925020890112, datetime.datetime(2019, 4, 10, 19, 56, 25, 730000), 'active', '7799', '5', '81330'),
 (2421471451521885696, 2483467254182955520, datetime.datetime(2019, 5, 26, 16, 44, 47, 680000), 'active', '2777', '3', '74464')]

In [4]:
%sql SELECT count(user_table.user_id), user_table.level, user_table.gender FROM user_table GROUP BY user_table.level, user_table.gender

 * postgresql://student:***@127.0.0.1/sparkifydb
4 rows affected.

[(35, 'free', 'M'), (41, 'free', 'F'), (14, 'paid', 'F'), (6, 'paid', 'M')]

In [5]:
%sql SELECT * FROM user_table ORDER BY user_id LIMIT 5 ;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(2, 'Jizelle', 'Benjamin', 'F', 'free'),
 (3, 'Isaac', 'Valdez', 'M', 'free'),
 (4, 'Alivia', 'Terrell', 'F', 'free'),
 (5, 'Elijah', 'Davis', 'M', 'free'),
 (6, 'Cecilia', 'Owens', 'F', 'free')]

In [6]:
%sql SELECT * FROM song_table LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, Decimal('218.93179')),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, Decimal('266.39628')),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, Decimal('269.81832')),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, Decimal('189.57016')),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, Decimal('148.03546'))]

In [7]:
%sql SELECT * FROM artist_table LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', Decimal('NaN'), Decimal('NaN')),
 ('ARNTLGG11E2835DDB9', 'Clp', '', Decimal('NaN'), Decimal('NaN')),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', Decimal('NaN'), Decimal('NaN')),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892'))]

In [8]:
%sql SELECT * FROM time_table LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 30, 0, 22, 7, 796000), 0, 30, 48, 11, 2018, 4),
 (datetime.datetime(2018, 11, 30, 1, 8, 41, 796000), 1, 30, 48, 11, 2018, 4),
 (datetime.datetime(2018, 11, 30, 1, 12, 48, 796000), 1, 30, 48, 11, 2018, 4),
 (datetime.datetime(2018, 11, 30, 1, 17, 5, 796000), 1, 30, 48, 11, 2018, 4),
 (datetime.datetime(2018, 11, 30, 1, 20, 56, 796000), 1, 30, 48, 11, 2018, 4)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).